Revit 2024 API
SaveAsOptions.MaximumBackups Property
 The maximum number of backups to keep on disk.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int MaximumBackups { get; set; }
Visual Basic
Public Property MaximumBackups As Integer
	Get
	Set
Visual C++
public:
property int MaximumBackups {
	int get ();
	void set (int value);
}
Field Value
 A positive number means to keep at most that many backups.
 The default value of -1 means to use Revit's defaults: 3 for non-workshared, 20 for workshared. After initialization, the setter can be used to choose a positive number, but cannot be used to restore this default value.
Remarks
 Non-workshared models have whole-file backups, sequentially numbered.
 File-based workshared models have eager, incremental backups in a backup folder adjacent to the model itself: Every save backs up all changed data and avoids recopying unchanged elements, so the latest backup is equivalent to the main copy on disk and the backup folder does not have huge amounts of redundant data.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The requested number of backups is out of range.
See Also
SaveAsOptions Class
Autodesk.Revit.DB Namespace